---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoom
source: html/3414edaf-ce4a-fc42-9c3f-baeec8a60459.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoom Property

[Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomTagNotInRoom { get; }
```